#+TITLE: October 10-23, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                    | WAITING | DONE | CANCELED |
|------+------+------------------------------------------------+---------+------+----------|
|      |      | DEV.1539622282. Learning Golang Chapter 6 Exer |         |      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME        | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-------------+-----------+--------+------+-----------+--------------+------------|
| Bhavin192   |      5.33 |   2.42 |    0 |      5.33 |   2018-10-31 | ---------- |
| Homuncculus |         0 |      0 |    0 |         0 |   2018-10-16 | ---------- |
| Sidntrivedi |         0 |      0 |    0 |         0 |   2018-10-16 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  50 +---------------------------------------------------------------------+   
:     |    ....                                                             |   
:  45 |+       .                                             ACTUAL #######+|   
:     |         .....                                         IDEAL ....... |   
:  40 |+             .....                                                 +|   
:  35 |+                  .....                                            +|   
:     |                        ....                                         |   
:  30 |+                           .                                       +|   
:     |                             .....                                   |   
:  25 |+                                 .....                             +|   
:     |                                       ....                          |   
:  20 |+                                          .                        +|   
:     |                                            .....                    |   
:  15 |+                                                .....              +|   
:  10 |+                                                     .....         +|   
:     |                                                           ....      |   
:   5 |+                                                              .    +|   
:     |                                                                .....|   
:   0 +---------------------------------------------------------------------+   
:     0         2         4         6         8         10        12        14  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:14]"
#+BEGIN: block-update-burndown
| DAY |       DATE |             ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------------------+-------+-----------------|
|   1 | 2018-10-10 | 49.989999999999995 |    46 |                 |
|   2 | 2018-10-11 | 49.989999999999995 |    43 |                 |
|   3 | 2018-10-12 | 49.989999999999995 |    39 |                 |
|   4 | 2018-10-13 | 49.989999999999995 |    36 |                 |
|   5 | 2018-10-14 | 49.989999999999995 |    32 |                 |
|   6 | 2018-10-15 | 49.989999999999995 |    29 |                 |
|   7 | 2018-10-16 | 49.989999999999995 |    25 |                 |
|   8 | 2018-10-17 |                    |    21 |                 |
|   9 | 2018-10-18 |                    |    18 |                 |
|  10 | 2018-10-19 |                    |    14 |                 |
|  11 | 2018-10-20 |                    |    11 |                 |
|  12 | 2018-10-21 |                    |     7 |                 |
|  13 | 2018-10-22 |                    |     4 |                 |
|  14 | 2018-10-23 |                    |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                   | TASKID          | OWNER          | PRIORITY | TODO        |          ESTIMATED | ACTUAL |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| TASKS                                                  |                 |                | B        |             | 49.989999999999995 |   2.42 |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| [[https://www.hackerearth.com/practice/codemonk/][HackerEarth Codemonk Series]]                            | READ.1539000246 | sidntrivedi012 | A        |             |                  3 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Linux for you and me                                   | READ.1538996950 | sidntrivedi012 | A        |             |                  1 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Freecodecamp Javascript Algorithms and Data Structures | DEV.1538995712  | sidntrivedi012 | B        |             |                  8 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| The Rails Tutorial                                     | READ.1538996294 | sidntrivedi012 | B        |             |                  3 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Computer Network by Kruose & Ross - Part II            | READ.1539319760 | homuncculus    | B        |             |               14.0 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]]                                         | DEV.1539319809  | homuncculus    | B        |             |               10.0 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Python Tutorials - Part II                             | DEV.1539319867  | homuncculus    | B        |             |                4.0 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Learning Golang Chapter 6 Exercises                    | DEV.1539622282  | bhavin192      | B        | IN_PROGRESS |               5.33 |   2.42 |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Learning Golang Chapter 7. Interfaces                  | READ.1539622386 | bhavin192      | B        |             |                0.5 |        |
|--------------------------------------------------------+-----------------+----------------+----------+-------------+--------------------+--------|
| Learning Golang Chapter 7 Exercises                    | DEV.1539622626  | bhavin192      | B        |             |               1.16 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2018-10-10 Wed>
  :wpd-sidntrivedi:      1
  :wpd-homuncculus:      2
  :wpd-bhavin192:        0.5
  :END:
** [#A] [[https://www.hackerearth.com/practice/codemonk/][HackerEarth Codemonk Series]] [0/1]
  :PROPERTIES:
  :ESTIMATED: 3
  :ACTUAL:
  :OWNER: sidntrivedi012
  :ID: READ.1539000246
  :TASKID: READ.1539000246
  :END:      
  - [ ] Trees			(3 hrs))
** [#A] Linux for you and me [0/1]
  :PROPERTIES:
  :ESTIMATED: 1
  :ACTUAL:
  :OWNER: sidntrivedi012
  :ID: READ.1538996950
  :TASKID: READ.1538996950
  :END:
  - [ ] Shell Commands		(1 hr)
** Freecodecamp Javascript Algorithms and Data Structures [0/1]
   :PROPERTIES:
   :ESTIMATED: 8 
   :ACTUAL:
   :OWNER:    sidntrivedi012
   :ID:       DEV.1538995712
   :TASKID:   DEV.1538995712
   :END:
   - [ ] Basic Javascript		(8 hrs)
** The Rails Tutorial [0/2]
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:
   :OWNER:    sidntrivedi012
   :ID:       READ.1538996294
   :TASKID:   READ.1538996294
   :END:
   - [ ] From zero to deploy		(1 hrs)
   - [ ] A toy app			(2 hrs)
** Computer Network by Kruose & Ross - Part II [0/4]                   :read:
   :PROPERTIES:
   :ESTIMATED: 14.0
   :ACTUAL:
   :OWNER:    homuncculus
   :ID: READ.1539319760
   :TASKID: READ.1539319760
   :END:
   - [ ] Chapter 3. Transport Layer (TCP/IP Protocol Suit by Forouzan) (4h)
   - [ ] Practice Problems (3h)
   - [ ] Chapter 4. Network Layer (4h)
   - [ ] Practice Problems (3h)
** [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] [0%]
   :PROPERTIES:
   :ESTIMATED: 10.0
   :ACTUAL:
   :OWNER: homuncculus
   :ID: DEV.1539319809
   :TASKID: DEV.1539319809
   :END:
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial01/][Poll App, Part 1]] (30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial02/][Poll App, Part 2]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial03/][Poll App, Part 3]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial04/][Poll App, Part 4]] (1h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial05/][Poll App, Part 5]] (2h 30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial06/][Poll App, Part 6]] (30m)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial07/][Poll App, Part 7]] (2h)
   - [ ] [[https://docs.djangoproject.com/en/2.1/intro/reusable-apps/][Reusable Apps]] (30m)
** Python Tutorials - Part II [0/3]
   :PROPERTIES:
   :ESTIMATED: 4.0
   :ACTUAL:
   :OWNER:    homuncculus
   :ID: DEV.1539319867
   :TASKID: DEV.1539319867
   :END:
   - [ ] [[https://docs.python.org/3/tutorial/stdlib.html][Brief tour of standard library - I]] (1h)
   - [ ] [[https://docs.python.org/3/tutorial/stdlib2.html][Brief tour of standard library - II]] (2h)
   - [ ] [[https://docs.python.org/3/tutorial/venv.html][Virtual environments & packages]] (45m)
** IN_PROGRESS Learning Golang Chapter 6 Exercises [2/5]
   :PROPERTIES:
   :ESTIMATED: 5.33
   :ACTUAL:   2.42
   :OWNER: bhavin192
   :ID: DEV.1539622282
   :TASKID: DEV.1539622282
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-14 Sun 18:30]--[2018-10-14 Sun 18:56] =>  0:26
   CLOCK: [2018-10-14 Sun 18:18]--[2018-10-14 Sun 18:28] =>  0:10
   CLOCK: [2018-10-14 Sun 17:54]--[2018-10-14 Sun 18:17] =>  0:23
   CLOCK: [2018-10-14 Sun 17:23]--[2018-10-14 Sun 17:40] =>  0:17
   CLOCK: [2018-10-12 Fri 22:57]--[2018-10-12 Fri 23:35] =>  0:38
   CLOCK: [2018-10-10 Wed 22:59]--[2018-10-10 Wed 23:30] =>  0:31
   :END:
   - [X] 6.1 (90m)
   - [X] 6.2 (20m)
   - [ ] 6.3 (150m)
   - [ ] 6.4 (30m)
   - [ ] 6.5 (30m)
** Learning Golang Chapter 7. Interfaces [0/1]
   :PROPERTIES:
   :ESTIMATED: 0.5
   :ACTUAL:
   :OWNER: bhavin192
   :ID: READ.1539622386
   :TASKID: READ.1539622386
   :END:
   - [ ] 7.1 Interfaces as Contracts (30m)
** Learning Golang Chapter 7 Exercises [0/1]
   :PROPERTIES:
   :ESTIMATED: 1.16
   :ACTUAL:
   :OWNER: bhavin192
   :ID: DEV.1539622626
   :TASKID: DEV.1539622626
   :END:
   - [ ] 7.1 Part I (70m)
